# Whitney Hardy 
## Task 4.9 Intro to Data Visualization with Python

#### Content List
- Import libraries
- Import data
- Wrangle new dataframe
- Data quality and consistency checks
- Combine customer data with ors_prods_merge dataframe
- Export data

### Import Libraries

In [1]:
# importing libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

### Import Data

In [2]:
#create a path 
path = r'C:\Users\hardy\10-2025 Instacart Basket Analysis'

In [3]:
#test path 
path

'C:\\Users\\hardy\\10-2025 Instacart Basket Analysis'

In [5]:
#import new customers dataframe
df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [6]:
#check output
df_customers.shape

(206209, 10)

In [7]:
#check output with head function 
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [8]:
#check output with describe function 
df_customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [9]:
#check output with info function 
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

### Wrangle new dataframe

In [22]:
#change column names to be consistent with other dataframes used. 
df_customers.rename(columns = {'First Name': 'first_name', 'Surnam': 'last_name', 'Gender': 'gender', 'STATE': 'state', 'Age': 'age', 'n_dependants': 'number_of_dependents'}, inplace = True)

In [23]:
#Check output
df_customers

,user_id,gender,state,age,date_joined,n_dependents,marital_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374
...,...,...,...,...,...,...,...,...
206204,168073,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Female,California,27,4/1/2020,1,married,99799
206208,80148,Female,New York,55,4/1/2020,1,married,57095

In [12]:
#drop first_name and last_name columns, as they do not add anything to my analysis
df_customers = df_customers.drop(columns=['first_name', 'last_name'])

In [13]:
#check output
df_customers.head()

,user_id,gender,state,age,date_joined,n_dependents,fam_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

In [25]:
#change column name 'n_dependants' to 'number_of_dependants'
df_customers.rename(columns = {'n_dependents' : 'number_of_dependents'}, inplace = True)

In [18]:
#rename 'fam_status' to 'marital_status'
df_customers.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [26]:
#check outputs
df_customers.head()

,user_id,gender,state,age,date_joined,number_of_dependents,marital_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

All column heads are now in the same format and have names that make sense. Additionally, I removed first and last names as to protect the privacy of the customers as we have a user_id assigned to designate different customers.

### Data quality and consistency checks

In [27]:
# check to see if there are any missing values
df_customers.isnull().sum()

user_id                 0
gender                  0
state                   0
age                     0
date_joined             0
number_of_dependents    0
marital_status          0
income                  0
dtype: int64

In [28]:
# check for duplicate data
df_dups = df_customers[df_customers.duplicated()]

In [30]:
# check output
df_dups

Empty DataFrame
Columns: [user_id, gender, state, age, date_joined, number_of_dependents, marital_status, income]
Index: []

In [31]:
#check for mixed data types
df_customers.dtypes

user_id                  int64
gender                  object
state                   object
age                      int64
date_joined             object
number_of_dependents     int64
marital_status          object
income                   int64
dtype: object

In [33]:
#change user_id data type from integer to string as it is numbers used to identify users and will not need to calculate 
df_customers['user_id'] = df_customers['user_id'].astype('str')

In [34]:
#check output 
df_customers.dtypes

user_id                 object
gender                  object
state                   object
age                      int64
date_joined             object
number_of_dependents     int64
marital_status          object
income                   int64
dtype: object

I checked for missing values, duplicates, and data types. There were no values missing, no duplicated data, and I changed 'user_id' column data type to string because the numbers are not being used as numerical values but as identifiers.

### Combine customer data with ords_prods_merge data frame

In [35]:
#upload ords_prods_merge dataframe
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 data', 'prepared data', 'ords_prods_merge_Task_4_8.pkl'))

In [36]:
#check output using shape function 
ords_prods_merge.shape

(32399732, 26)

In [37]:
#check output using head function 
ords_prods_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_spend_user,spending_flag,ord_regularity_median,frequency_flag
0,2539329,1,1,2,8,NaN,True,196,1,0,...,Mid-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2539329,1,1,2,8,NaN,True,14084,2,0,...,Mid-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,2539329,1,1,2,8,NaN,True,12427,3,0,...,Low-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2539329,1,1,2,8,NaN,True,26088,4,0,...,Low-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,2539329,1,1,2,8,NaN,True,26405,5,0,...,Low-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [38]:
#check column names
ords_prods_merge.columns

Index(['order_id', 'user_id', 'order_number', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_prior_order', 'first_order',
       'product_id', 'add_to_cart_order', 'reordered', '_merge',
       'product_name', 'aisle_id', 'department_id', 'prices', 'Match',
       'price_range_loc', 'busiest_day', 'busiest_days',
       'busiest_period_of_day', 'max_order', 'loyalty_flag', 'avg_spend_user',
       'spending_flag', 'ord_regularity_median', 'frequency_flag'],
      dtype='object')

user_id is the key column to merge the two dataframes. I am first going to double check they have the same data types.

I know customers df user_id is a string, I am going to check ords_prods_merge is the same

In [41]:
#check data types
ords_prods_merge.dtypes

order_id                     int64
user_id                      int64
order_number                 int64
orders_day_of_week           int64
order_hour_of_day            int64
days_since_prior_order     float64
first_order                   bool
product_id                   int64
add_to_cart_order            int64
reordered                    int64
_merge                    category
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
Match                     category
price_range_loc             object
busiest_day                 object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
avg_spend_user             float64
spending_flag               object
ord_regularity_median      float64
frequency_flag              object
dtype: object

In [42]:
#change user_id to string
ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype('str')

In [45]:
#check output
ords_prods_merge.dtypes

order_id                     int64
user_id                     object
order_number                 int64
orders_day_of_week           int64
order_hour_of_day            int64
days_since_prior_order     float64
first_order                   bool
product_id                   int64
add_to_cart_order            int64
reordered                    int64
_merge                    category
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
Match                     category
price_range_loc             object
busiest_day                 object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
avg_spend_user             float64
spending_flag               object
ord_regularity_median      float64
frequency_flag              object
dtype: object

In [53]:
#merge the two df
df_merging = ords_prods_merge.merge(df_customers, on = 'user_id', indicator ='merging status')

In [54]:
#check output
df_merging. head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,...,ord_regularity_median,frequency_flag,gender,state,age,date_joined,number_of_dependents,marital_status,income,merging status
0,2539329,1,1,2,8,NaN,True,196,1,0,...,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,...,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,...,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,...,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,...,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423,both

In [55]:
df_merging.shape

(32399732, 34)

In [56]:
df_merging.columns

Index(['order_id', 'user_id', 'order_number', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_prior_order', 'first_order',
       'product_id', 'add_to_cart_order', 'reordered', '_merge',
       'product_name', 'aisle_id', 'department_id', 'prices', 'Match',
       'price_range_loc', 'busiest_day', 'busiest_days',
       'busiest_period_of_day', 'max_order', 'loyalty_flag', 'avg_spend_user',
       'spending_flag', 'ord_regularity_median', 'frequency_flag', 'gender',
       'state', 'age', 'date_joined', 'number_of_dependents', 'marital_status',
       'income', 'merging status'],
      dtype='object')

### Export data

In [58]:
#export
df_merging.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'merging_exercise_4_9.pkl'))